import random

def countingSort(A, div): # А - вхідний масив, div - дільник
    n = len(A)  # n - довжина вхідного масиву А
    output = [0] * (n) # вихідний масив
    C = [0] * (10) # масив для зберігання кількості входжень цифри

    for i in range(0, n):
        C[int(A[i]/div) % 10] += 1 # C[i] записується кількість елементів, які дорівнюють i

    for i in range(1, 10):
        C[i] += C[i - 1] # в C[i] записується кількість елементів, які не більші за i

    for i in range(n-1, -1,-1):
        output[C[int(A[i]/div) % 10] - 1] = A[i] # розставляємо елементи масива в правильній послідовності
        C[int(A[i]/div) % 10] -= 1 # зменшуємо кількість на 1
    for i in range(0, len(A)):
        A[i] = output[i] # копіюємо в А значення відсортованого масива

def GenArr(d):
    arr = [x for x in range(10**(d-1),10**d)] # генеруємо елементи масива
    random.shuffle(arr) # перетасовуємо в рандомному порядку
    arr = resize(arr) # функція зменшує розмір згенерованого мисива з d елементів до d/10
    return arr

def resize(arr): # зменшення розміру знегерованого масива до з n до n/10
    a = []
    for i in range(len(arr)//10):
        a.append(arr[i])
    return a

def radixSort(arr, d):  # d - кількість розрядів
    div = 1 # дільник за допомогою якого визначається розряд для сортування
    while d / div > 0: # перевірка чи має число даний розряд
        countingSort(arr, div) # викликаємо функцію сортування підрахунком
        div*= 10 # для переходу до наступного розряду збільуємо дільник в 10 разів


d = input("Введіть d: ") # введення кількість цифр чисел - елементів масива
arr = [] # cтворення пустого списку масиву
arr = GenArr(int(d)) # заповнення масиву  рандомними елементами кількість цифр яких = d
print("unsorted: ", arr)
radixSort(arr,int(d)) # виклик функції сортування
print("sorted: ", arr) # виведення відсортованого масиву на екран
